financial_accounts = {
    #key:(col,raw)
    "الحسابات الرئيسية": {
        "الموارد": {
            "debit": (6, 6),
            "credit": (11, 6)
        },
        "الاستخدامات": {
            "debit": (6, 7),
            "credit": (11, 7)
        },
        "حساب البنك موارد محلية": {
            "debit": (6, 8),
            "credit": (11, 8)
        },
        "حساب البنك نفقات تشغيلية محلية": {
            "debit": (6, 9),
            "credit": (11, 9)
        },
        "حساب البنك اكتساب أصول غير مالية محلية": {
            "debit": (6, 10),
            "credit": (11, 10)
        },
        "جملة الحسابات الرئيسية": {
            "debit": (6, 11),
            "credit": (11, 11)
        }
    },
    "الحسابات المساعدة المدينة": {
        "حساب النقدية": {
            "debit": (6, 13),
            "credit": (11, 13)
        },
        "حساب البنك موارد مشتركة": {
            "debit": (6, 14),
            "credit": (11, 14)
        },
        "حساب البنك حسابات جارية": {
            "debit": (6, 15),
            "credit": (11, 15)
        },
        "حساب البنك مساهمات ذاتية": {
            "debit": (6, 16),
            "credit": (11, 16)
        },
        "حساب السلف المؤقتة": {
            "debit": (6, 17),
            "credit": (11, 17)
        },
        "حساب سلف الحسابات الجارية": {
            "debit": (6, 18),
            "credit": (11, 18)
        },
        "حساب السلف على الأجور": {
            "debit": (6, 19),
            "credit": (11, 19)
        },
        "حساب الإعتمادات مستندية": {
            "debit": (6, 20),
            "credit": (11, 20)
        },
        "حساب المبالغ المدفوعة مقدما": {
            "debit": (6, 21),
            "credit": (11, 21)
        },
        "حساب المدينين (مالية)": {
            "debit": (6, 22),
            "credit": (11, 22)
        },
        "حساب المدينين (سلطة محلية)": {
            "debit": (6, 23),
            "credit": (11, 23)
        },
        "جملة الحسابات المساعدة المدينة": {
            "debit": (6, 24),
            "credit": (11, 24)
        }
    },
    "الحسابات المساعدة الدائنة": {
        "حساب الموارد المشتركة": {
            "debit": (6, 26),
            "credit": (11, 26)
        },
        "حساب الحسابات الجارية": {
            "debit": (6, 27),
            "credit": (11, 27)
        },
        "حساب المساهمات الذاتية": {
            "debit": (6, 28),
            "credit": (11, 28)
        },
        "حساب المبالغ الدائنة تحت التسوية": {
            "debit": (6, 29),
            "credit": (11, 29)
        },
        "حساب الدائنين (مالية)": {
            "debit": (6, 30),
            "credit": (11, 30)
        },
        "حساب الدائنين سلطة (محلية)": {
            "debit": (6, 31),
            "credit": (11, 31)
        },
        "جملة الحسابات المساعدة الدائنة": {
            "debit": (5, 32),
            "credit": (10, 32)
        }
    },
    "الحسابات الإنتقالية المدينة": {
        "حساب البنك أمانات": {
            "debit": (6, 34),
            "credit": (11, 34)
        },
        "حساب إلتزامات سلع وخدمات وممتلكات": {
            "debit": (6, 35),
            "credit": (11, 35)
        },
        "حساب إلتزامات إكتساب أصول ثابتة": {
            "debit": (15, 36),
            "credit": (11, 36)
        },
        "حساب إلتزامات إكتساب أصول غير منتجة": {
            "debit": (6, 37),
            "credit": (11, 37)
        },
        "حساب تسوية الموارد المحصلة مقدما": {
            "debit": (6, 38),
            "credit": (11, 38)
        },
        "حساب الموارد المستحقة": {
            "debit": (6, 39),
            "credit": (11, 39)
        },
        "حساب النفقات المقدمة عن سلع وخدمات وممتلكات": {
            "debit": (6, 40),
            "credit": (11, 40)
        },
        "جملة الحسابات الانتقالية المدينة": {
            "debit": (6, 41),
            "credit": (11, 41)
        }
    },
    "الحسابات الإنتقالية الدائنة": {
        "حساب مرتجع الأجور": {
            "debit": (6, 43),
            "credit": (11, 43)
        },
        "حساب التأمينات المتنوعة": {
            "debit": (6, 44),
            "credit": (11, 44)
        },
        "حساب المبالغ الدائنة المحصنة للغير": {
            "debit": (6, 45),
            "credit": (11, 45)
        },
        "حساب دائنون التزامات قائمة": {
            "debit": (6, 46),
            "credit": (11, 46)
        },
        "حساب الموارد المحصلة مقدما": {
            "debit": (6, 47),
            "credit": (11, 47)
        },
        "حساب تسوية المستحقات والمقدمات المدينة": {
            "debit": (6, 48),
            "credit": (11, 48)
        },
        "جملة الحسابات الإنتقالية الدائنة": {
            "debit": (6, 49),
            "credit": (11, 49)
        }
    },
    "الحسابات النظامية": {
        "حساب الكفالات": {
            "debit": (6, 51),
            "credit": (11, 51)
        },
        "حساب امانات الكفالات": {
            "debit": (6, 52),
            "credit": (11, 52)
        },
        "حساب الديون المستحقة للحكومة": {
            "debit": (6, 53),
            "credit": (11, 53)
        },
        "حساب متابعة مطلوبات الحكومة": {
            "debit": (6, 54),
            "credit": (11, 54)
        },
        "حساب الشيكات الواردة للتحصيل": {
            "debit": (6, 55),
            "credit": (11, 55)
        },
        "حساب الشيكات تحت التحصيل": {
            "debit": (6, 56),
            "credit": (11, 56)
        },
        "حساب الشيكات الواردة المؤجلة": {
            "debit": (6, 57),
            "credit": (11, 57)
        },
        "حساب الشيكات المؤجلة": {
            "debit": (6, 58),
            "credit": (11, 58)
        },
        "حساب المبالغ المستحقة عن أوراق ونماذج ذات قيمة": {
            "debit": (6, 59),
            "credit": (11, 59)
        },
        "حساب متابعة المبالع المستحقة من أوراق ونماذج ذات قيمة": {
            "debit": (6, 60),
            "credit": (11, 60)
        },
        "جملة الحسابات النظامية": {
            "debit": (6, 61),
            "credit": (11, 61)
        }
    },
    "الحسابات الرقابية الإحصائية": {
        "حساب إكتساب الاصول غير المالية": {
            "debit": (6, 63),
            "credit": (11, 63)
        },
        "حساب مراقبه إكتساب الاصول غير المالية": {
            "debit": (6, 64),
            "credit": (11, 64)
        },
        "حساب مراقبه المساهمات الذاتية والتعاونية": {
            "debit": (6, 65),
            "credit": (11, 65)
        },
        "حساب المساهمات الذاتية والتعاونية": {
            "debit": (6, 66),
            "credit": (11, 66)
        },
        "جملة الحسابات الرقابية الإحصائية": {
            "debit": (6, 67),
            "credit": (11, 67)
        },
        "الاجمالي العام": {
            "debit": (6, 68),
            "credit": (11, 68)
        }
    }
}
